<script setup lang="ts">
const headers = ["対象", "図書", "学科推奨図書", "雑誌／楽譜", "CD/レコード"];
const period = [
  ["1～3年生／科目等履修生／ディプロマ生", "2週間", "2週間", "1週間", "翌々日"],
  ["4年生", "30日", "2週間", "1週間", "翌々日"],
  ["大学院生", "30日", "2週間", "1週間", "1週間"],
  ["職員／定年退職教職員", "30日", "不可", "1週間", "1週間"],
  ["卒業生／中高生", "2週間", "不可", "1週間", "翌々日"],
  [
    "専任教員／名誉教授",
    "当年度2月末まで",
    "不可",
    "当年度2月末まで",
    "当年度2月末まで",
  ],
  [
    "非常勤教員",
    "当年度1月末まで",
    "不可",
    "当年度1月末まで",
    "当年度1月末まで",
  ],
];
</script>

<template>
  <text-sub-title>貸出期間</text-sub-title>
  <the-table :items-array="period" :headers="headers"></the-table>
  <v-alert type="info" class="mt-4">
    春・夏・冬季休暇中には学部生・大学院生を対象に長期貸出を行います。詳細はこのHPや掲示などでお知らせします。
  </v-alert>
</template>
