import type { Shelves } from '@/types'

export const browseCultural: Shelves = [
  {
    name: 'アメリカ・ラテンアメリカ関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.5',
            name: '北アメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.55',
            name: 'ラテンアメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.6',
            name: '南アメリカの政治・経済・社会文化事情',
          },
        ],
      },

      {
        name: '歴史',
        genres: [
          {
            sign: '250',
            name: '北アメリカの歴史',
          },
          {
            sign: '253',
            name: 'アメリカ合衆国の歴史',
          },
          {
            sign: '256',
            name: 'メキシコの歴史',
          },
          {
            sign: '260',
            name: '南アメリカの歴史',
          },
          {
            sign: '262',
            name: 'ブラジルの歴史',
          },
          {
            sign: '265',
            name: 'アルゼンチンの歴史',
          },
          {
            sign: '268',
            name: 'ペルーの歴史',
          },
        ],
      },

      {
        name: '地理',
        genres: [
          {
            sign: '295',
            name: '北アメリカの地理',
          },
          {
            sign: '296',
            name: '南アメリカの地理',
          },
        ],
      },

      {
        name: '政治',
        genres: [
          {
            sign: '312.53',
            name: 'アメリカ合衆国の政治',
          },
          {
            sign: '312.5～312.8',
            name: 'ラテンアメリカの政治',
          },
        ],
      },

      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.53',
            name: 'アメリカ合衆国の外交',
          },
        ],
      },

      {
        name: '文学',
        genres: [
          {
            sign: '930',
            name: '英米文学',
          },
          {
            sign: 'A930～A939',
            name: 'アメリカ文学',
          },
          {
            sign: '968',
            name: 'ラテンアメリカ文学',
          },
        ],
      },
    ],
  },

  {
    name: 'イギリス・フランス・ヨーロッパ関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.33',
            name: 'イギリスの政治・経済・社会文化事情',
          },
          {
            sign: '302.34',
            name: 'ドイツの政治・経済・社会文化事情',
          },
          {
            sign: '302.35',
            name: 'フランスの政治・経済・社会文化事情',
          },
          {
            sign: '302.38',
            name: 'ロシア・ベラルーシ・ウクライナの政治・経済・社会文化事情',
          },
        ],
      },

      {
        name: '歴史',
        genres: [
          {
            sign: '230',
            name: 'ヨーロッパの歴史',
          },
          {
            sign: '233',
            name: 'イギリスの歴史',
          },
          {
            sign: '234',
            name: 'ドイツの歴史',
          },
          {
            sign: '235',
            name: 'フランスの歴史',
          },
          {
            sign: '236',
            name: 'スペイン・ポルトガルの歴史',
          },
          {
            sign: '237',
            name: 'イタリアの歴史',
          },
          {
            sign: '238',
            name: 'ロシア・北ヨーロッパの歴史',
          },
        ],
      },

      {
        name: '地理',
        genres: [
          {
            sign: '293',
            name: 'ヨーロッパの地理',
          },
        ],
      },

      {
        name: '政治',
        genres: [
          {
            sign: '312.3',
            name: 'ヨーロッパの政治',
          },
        ],
      },

      {
        name: '民族・人種問題',
        genres: [
          {
            sign: '316.88',
            name: 'ユダヤ人問題',
          },
        ],
      },

      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.3',
            name: '欧州統合・ヨーロッパの外交',
          },
        ],
      },

      {
        name: '文学',
        genres: [
          {
            sign: '930',
            name: '英米文学',
          },
          {
            sign: '930～939',
            name: 'イギリス文学',
          },
          {
            sign: '940～949',
            name: 'ドイツ文学',
          },
          {
            sign: '950～959',
            name: 'フランス文学',
          },
          {
            sign: '960～969',
            name: 'スペイン・ポルトガル文学',
          },
          {
            sign: '970～979',
            name: 'イタリア文学',
          },
          {
            sign: '980～989',
            name: 'ロシア・ソヴィエト・スラブ文学',
          },
          {
            sign: '991～993',
            name: 'ギリシア・ラテン・その他のヨーロッパ文学',
          },
        ],
      },
    ],
  },

  {
    name: '中国・韓国・アジア関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.2',
            name: 'アジアの政治・経済・社会文化事情',
          },
          {
            sign: '302.21',
            name: '韓国・朝鮮の政治・経済・社会文化事情',
          },
          {
            sign: '302.22',
            name: '中国の政治・経済・社会文化事情',
          },
          {
            sign: '302.23',
            name: '東南アジアの政治・経済・社会文化事情',
          },
          {
            sign: '302.23',
            name: 'インドネシアの政治・経済・社会文化事情',
          },
          {
            sign: '302.25',
            name: 'インドの政治・経済・社会文化事情',
          },
          {
            sign: '302.27',
            name: '中東の政治・経済・社会文化事情',
          },
        ],
      },

      {
        name: '歴史',
        genres: [
          {
            sign: '221',
            name: '韓国・朝鮮の歴史',
          },
          {
            sign: '222',
            name: '中国の歴史',
          },
          {
            sign: '223',
            name: '東南アジアの歴史',
          },
          {
            sign: '225',
            name: 'インドの歴史',
          },
          {
            sign: '226～228',
            name: '中東・アラブ諸国の歴史',
          },
        ],
      },

      {
        name: '地理',
        genres: [
          {
            sign: '292',
            name: 'アジアの地理',
          },
        ],
      },

      {
        name: '政治',
        genres: [
          {
            sign: '312.2',
            name: 'アジアの政治',
          },
        ],
      },

      {
        name: '民族・人種問題',
        genres: [
          {
            sign: '316.81～316.82',
            name: '在日朝鮮人・アイヌ問題',
          },
        ],
      },

      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.2',
            name: 'アジアの外交',
          },
        ],
      },

      {
        name: '文学',
        genres: [
          {
            sign: '920～928',
            name: '中国文学',
          },
          {
            sign: '929.1',
            name: '韓国・朝鮮文学',
          },
          {
            sign: '929.2～929.9',
            name: 'その他の東洋文学',
          },
        ],
      },
    ],
  },

  {
    name: '日本語・日本文学・和漢比較関連の本棚',
    categories: [
      {
        name: '叢書（シリーズ・全集・選集）',
        genres: [
          {
            sign: '081',
            name: '日本語の全集・選集・著作集',
          },
          {
            sign: '082',
            name: '中国語の全集・選集・著作集',
          },
          {
            sign: '082||C62',
            name: '中国古典新書（明徳出版社）',
          },
          {
            sign: '082||Sh69',
            name: '新釈漢文大系（明治書院）',
          },
          {
            sign: '082||Z3',
            name: '全釈漢文大系（集英社）',
          },
          {
            sign: '※ 082.7||B89',
            name: '景印文淵閣四庫全書　※1階中国書コーナーにあり',
          },
        ],
      },

      {
        name: '歴史',
        genres: [
          {
            sign: '210～219',
            name: '日本史',
          },
          {
            sign: '210.08',
            name: '日本史全集・叢書',
          },
          {
            sign: '210.08||Ko53',
            name: '国史大系（吉川弘文館）',
          },
          {
            sign: '210.088',
            name: '古文書・史料',
          },
          {
            sign: '210.088||D25',
            name: '大日本古記録（岩波書店）',
          },
          {
            sign: '210.088||DSh89',
            name: '史料纂集（続群書類従完成会）・史料大成（臨川書店）',
          },
        ],
      },

      {
        name: '言語学',
        genres: [
          {
            sign: '801',
            name: '言語学・音声学・音韻論・意味論・語用論・文章論',
          },
          {
            sign: '807',
            name: '言語教育・言語学習・第二言語',
          },
          {
            sign: '809',
            name: '話し方・発声・スピーチ・議論・ディベート・プレゼン',
          },
          {
            sign: '810～819',
            name: '日本語・日本語学',
          },
          {
            sign: '810.1',
            name: '日本語理論・国語学・談話分析',
          },
          {
            sign: '810.7',
            name: '日本語教育・日本語教師・日本語能力試験',
          },
          {
            sign: '811',
            name: '音韻・発声・アクセント・文字・漢字・かな',
          },
          {
            sign: '812',
            name: '語源・意味',
          },
          {
            sign: '814',
            name: '語彙・古語・新語・オノマトペ・俗語・隠語',
          },
          {
            sign: '815',
            name: '文法・語法・敬語',
          },
          {
            sign: '816',
            name: '文章・文体・作文・論文の書き方',
          },
          {
            sign: '818',
            name: '方言・地方のことば',
          },
          {
            sign: '820～828',
            name: '中国語・中国語学・漢語・漢字',
          },
        ],
      },

      {
        name: '文学',
        genres: [
          {
            sign: '900～908',
            name: '文学理論・文学史・文学思想史',
          },
          {
            sign: '909',
            name: '児童文学・童話',
          },
          {
            sign: '910～919',
            name: '日本文学',
          },
          {
            sign: '910.2',
            name: '日本文学史',
          },
          {
            sign: '911',
            name: '詩歌',
          },
          {
            sign: '911.1',
            name: '和歌・短歌・百人一首',
          },
          {
            sign: '913',
            name: '小説・物語',
          },
          {
            sign: '913.2',
            name: '上代文学・古事記・日本書紀・風土記',
          },
          {
            sign: '913.3',
            name: '中古文学・平安文学・源氏物語・伊勢物語ほか',
          },
          {
            sign: '913.4',
            name: '中世文学・鎌倉室町文学・平家物語・宇治拾遺物語ほか',
          },
          {
            sign: '913.5',
            name: '近世（江戸時代）文学・雨月物語・仮名草子・西鶴作品ほか',
          },
          {
            sign: '913.6',
            name: '近現代（明治時代以降）文学・小説',
          },
          {
            sign: '914',
            name: '評論・エッセイ・随筆',
          },
          {
            sign: '915',
            name: '日記・書簡・紀行',
          },
          {
            sign: '918',
            name: '作品集・全集・選集',
          },
          {
            sign: '918||N77',
            name: '日本古典文学全集（新潮社）・日本古典全書（朝日新聞社）ほか',
          },
          {
            sign: '918||S55',
            name: '新潮日本古典集成',
          },
          {
            sign: '918||Sh64',
            name: '新日本古典文学大系（岩波書店）',
          },
          {
            sign: '918||Sh69',
            name: '新編日本古典文学全集（小学館）',
          },
          {
            sign: '919',
            name: '漢詩文・日本漢文学',
          },
          {
            sign: '920～929',
            name: '中国文学',
          },
        ],
      },
    ],
  },

  {
    name: '英語・英語教育関連の本棚',
    categories: [
      {
        name: '言語学',
        genres: [
          {
            sign: '830～839',
            name: '英語・英語学',
          },
          {
            sign: '830.7',
            name: '英語教育・英語学習',
          },
          {
            sign: '837',
            name: '英会話・和文英訳・英文和訳・英文解釈',
          },
          {
            sign: '',
            name: '※Eng 英語学習用多読本　※4階多読本コーナーにあり',
          },
        ],
      },

      {
        name: '社会科学',
        genres: [
          {
            sign: '370～379',
            name: '教育・教育学',
          },
          {
            sign: '375',
            name: '教育課程・学習指導・教科別教育',
          },
          {
            sign: '375.89',
            name: '外国語教育',
          },
        ],
      },
    ],
  },

  {
    name: 'コミュニケーション関連の本棚',
    categories: [
      {
        name: '社会学',
        genres: [
          {
            sign: '361.45',
            name: 'コミュニケーション・コミュニケーション理論',
          },
        ],
      },

      {
        name: '言語学',
        genres: [
          {
            sign: '801',
            name: '社会言語学・音声・発音・翻訳・通訳・会話・非言語コミュニケーション',
          },
          {
            sign: '817',
            name: '日本語会話',
          },
          {
            sign: '830',
            name: '英語学・英語学習・英語教育・通訳',
          },
          {
            sign: '837',
            name: '英会話',
          },
        ],
      },
    ],
  },

  {
    name: '身体表現・スポーツ・舞踏関連の本棚',
    categories: [
      {
        name: '音楽',
        genres: [
          {
            sign: 'M0.7',
            name: '音楽教育・リトミック',
          },
          {
            sign: 'M3.6',
            name: '舞踏・バレエ',
          },
        ],
      },

      {
        name: '体育',
        genres: [
          {
            sign: '780～789',
            name: 'スポーツ・体育',
          },
          {
            sign: '780.1',
            name: '体育理論・スポーツ医学・エアロビクス・フィットネス',
          },
          {
            sign: '780.7',
            name: 'トレーニング・指導法・メンタルトレーニング',
          },
          {
            sign: '781',
            name: '体操・遊戯・リズム運動',
          },
          {
            sign: '781.4',
            name: '徒手体操・ストレッチ・ピラティス',
          },
        ],
      },

      {
        name: '社会科学',
        genres: [
          {
            sign: '370～379',
            name: '教育・教育学',
          },
          {
            sign: '375',
            name: '教育課程・学習指導・教科別教育',
          },
          {
            sign: '375.49',
            name: '保健・体育・ダンス（教科）',
          },
          {
            sign: '376',
            name: '幼児教育・初等教育・中等教育',
          },
          {
            sign: '376.15',
            name: 'リトミック・健康体操',
          },
        ],
      },
    ],
  },
  {
    name: 'ファッション・デザイン関連の本棚',
    categories: [
      {
        name: 'ファッション',
        genres: [
          {
            sign: '289',
            name: '伝記（ファッションデザイナー等）',
          },
          {
            sign: '383',
            name: '被服文化・風俗',
          },
          {
            sign: '589',
            name: '被服産業・アパレル',
          },
        ],
      },

      {
        name: 'デザイン',
        genres: [
          {
            sign: '674',
            name: '広告デザイン',
          },
          {
            sign: '757',
            name: 'デザイン・デザイナー・装飾美術',
          },
        ],
      },
    ],
  },

  {
    name: '音楽、アート、メディア関連の本棚',
    categories: [
      {
        name: '音楽、楽譜',
        genres: [
          {
            sign: 'M0.0～M5.9',
            name: '音楽関連図書',
          },
          {
            sign: 'M0.0～M0.9',
            name: '音楽学・音楽心理・音楽療法・音楽評論・音楽著作権',
          },
          {
            sign: 'M0.4',
            name: '音楽談義・音楽批評',
          },
          {
            sign: 'M0.67',
            name: '音楽著作権',
          },
          {
            sign: 'M0.9',
            name: '映画音楽・アニメ音楽',
          },
          {
            sign: 'M1.0～M1.9',
            name: '楽典・和声法・作曲法・演奏法・鑑賞法',
          },
          {
            sign: 'M2.0～M2.9',
            name: '音楽史・各国の音楽・作曲家研究・演奏家研究・伝記',
          },
          {
            sign: 'M3.0～M3.9',
            name: '声楽・歌唱法・宗教音楽・賛美歌・歌劇・バレエ・民謡',
          },
          {
            sign: 'M4.0～M4.9',
            name: '器楽・楽器・室内楽・管弦楽・吹奏楽・ロック・ジャズ・ポップ',
          },
          {
            sign: 'M4.57',
            name: 'コンピュータミュージック',
          },
          {
            sign: 'M5.0～M5.9',
            name: '邦楽・雅楽・能楽・狂言・民謡・現代邦楽',
          },
          {
            sign: 'M6.0～M9.9',
            name: '楽譜',
          },
          {
            sign: 'M6.0～M6.9',
            name: '声楽曲・宗教音楽・ミュージカル・唱歌・民謡・流行歌',
          },
          {
            sign: 'M7.0～M7.9',
            name: '器楽曲・管弦楽曲・ピアノ曲・吹奏楽曲・軽音楽曲',
          },
          {
            sign: 'M8.0～M8.9',
            name: '作品集・個人全集・ミニチュアスコア',
          },
          {
            sign: 'M9.0～M9.9',
            name: '邦楽曲',
          },
        ],
      },

      {
        name: '芸術、美術、大衆文化',
        genres: [
          {
            sign: '701',
            name: '芸術理論・美学',
          },
          {
            sign: '702',
            name: '芸術史・美術史',
          },
          {
            sign: '710～719',
            name: '彫刻',
          },
          {
            sign: '720～729',
            name: '絵画',
          },
          {
            sign: '721',
            name: '日本絵画・絵巻・浮世絵・草紙',
          },
          {
            sign: '723',
            name: '西洋絵画',
          },
          {
            sign: '726',
            name: 'マンガ・絵本・挿絵',
          },
          {
            sign: '750～759',
            name: '工芸・陶磁器・ガラス工芸・木工・宝石・色彩・インテリア',
          },
          {
            sign: '770～779',
            name: '演劇',
          },
          {
            sign: '771',
            name: '劇場・演出・俳優・演技・舞台衣装',
          },
          {
            sign: '773',
            name: '能楽・狂言',
          },
          {
            sign: '774',
            name: '歌舞伎',
          },
          {
            sign: '775',
            name: '各種演劇・宝塚歌劇・ミュージカル・新劇',
          },
          {
            sign: '778',
            name: '映画・アニメ・テレビドラマ・特撮',
          },
        ],
      },

      {
        name: 'マスメディア、ジャーナリズム',
        genres: [
          {
            sign: '070',
            name: 'ジャーナリズム・報道・新聞学',
          },
          {
            sign: '361.4',
            name: '社会心理学・マスコミ・マスメディア',
          },
          {
            sign: '699',
            name: '放送事業・テレビ・ラジオ・視聴率・放送番組',
          },
        ],
      },

      {
        name: '音楽ビジネス・マーケティング',
        genres: [
          {
            sign: 'M0',
            name: '音楽ビジネス・コンサートマネジメント',
          },
          {
            sign: '336',
            name: 'マネジメント・企業経営',
          },
          {
            sign: '675',
            name: 'マーケティング',
          },
        ],
      },
    ],
  },
]
