import type { Shelves } from '@/types'

export const browsePsychology: Shelves = [
  {
    name: '言語学・言語文化関連の本棚',
    categories: [
      {
        name: '言語学',
        genres: [
          {
            sign: '801',
            name: '言語学・音声学・音韻論・意味論・語用論・文章論',
          },
          {
            sign: '807',
            name: '言語教育・言語学習・第二言語',
          },
          {
            sign: '809',
            name: '話し方・発声・スピーチ・議論・ディベート・プレゼン',
          },
          {
            sign: '810～819',
            name: '日本語・日本語学',
          },
          {
            sign: '810.1',
            name: '日本語理論・国語学・談話分析',
          },
          {
            sign: '810.7',
            name: '日本語教育・日本語教師・日本語能力試験',
          },
          {
            sign: '811',
            name: '音韻・発声・アクセント・文字・漢字・かな',
          },
          {
            sign: '812',
            name: '語源・意味',
          },
          {
            sign: '814',
            name: '語彙・古語・新語・オノマトペ・俗語・隠語',
          },
          {
            sign: '815',
            name: '文法・語法・敬語',
          },
          {
            sign: '816',
            name: '文章・文体・作文・論文の書き方',
          },
          {
            sign: '818',
            name: '方言・地方のことば',
          },
          {
            sign: '820～828',
            name: '中国語・中国語学',
          },
          {
            sign: '829',
            name: '朝鮮語・アイヌ語',
          },
          {
            sign: '830～839',
            name: '英語・英語学',
          },
          {
            sign: '840～849',
            name: 'ドイツ語・ドイツ語学',
          },
          {
            sign: '850～859',
            name: 'フランス語・フランス語学',
          },
          {
            sign: '860～868',
            name: 'スペイン語・スペイン語学',
          },
          {
            sign: '869',
            name: 'ポルトガル語',
          },
          {
            sign: '870～878',
            name: 'イタリア語・イタリア語学',
          },
          {
            sign: '879',
            name: 'ルーマニア語',
          },
          {
            sign: '880～888',
            name: 'ロシア語・ロシア語学',
          },
          {
            sign: '889',
            name: 'ブルガリア語・ウクライナ語ほかスラブ諸国語',
          },
          {
            sign: '891',
            name: 'ギリシア語',
          },
          {
            sign: '892',
            name: 'ラテン語',
          },
        ],
      },
    ],
  },
  {
    name: '日本語・日本語教育関連の本棚',
    categories: [
      {
        name: '日本語学',
        genres: [
          {
            sign: '810～819',
            name: '日本語・日本語学',
          },
          {
            sign: '810.1',
            name: '日本語理論・国語学・談話分析',
          },
          {
            sign: '810.7',
            name: '日本語教育・日本語教師・日本語能力試験',
          },
          {
            sign: '811',
            name: '音韻・発声・アクセント・文字・漢字・かな',
          },
          {
            sign: '812',
            name: '語源・意味',
          },
          {
            sign: '814',
            name: '語彙・古語・新語・オノマトペ・俗語・隠語',
          },
          {
            sign: '815',
            name: '文法・語法・敬語',
          },
          {
            sign: '816',
            name: '文章・文体・作文・論文の書き方',
          },
          {
            sign: '818',
            name: '方言・地方のことば',
          },
        ],
      },
    ],
  },
  {
    name: '心理学関連の本棚',
    categories: [
      {
        name: '心理学',
        genres: [
          {
            sign: '140',
            name: '心理学理論・心理学史・心理測定・検査',
          },
          {
            sign: '141',
            name: '心理各論・知能・感覚・記憶・思考・認知・行動',
          },
          {
            sign: '143',
            name: '発達心理学・比較心理学・民族心理学',
          },
          {
            sign: '146',
            name: '臨床心理学・精神分析学・臨床診断法・カウンセリング',
          },
          {
            sign: '147',
            name: '超心理学・予知・透視・心霊現象・超能力',
          },
        ],
      },

      {
        name: '宗教',
        genres: [
          {
            sign: '161.4',
            name: '宗教心理学',
          },
        ],
      },

      {
        name: '法律',
        genres: [
          {
            sign: '326.3',
            name: '犯罪心理学',
          },
        ],
      },

      {
        name: '社会学',
        genres: [
          {
            sign: '361.4',
            name: '社会心理学・集団心理・コミュニケーション・パーソナリティ',
          },
        ],
      },

      {
        name: '教育学',
        genres: [
          {
            sign: '371.4',
            name: '教育心理学・学習適応・校内暴力・いじめ・登校拒否・カウンセリング',
          },
        ],
      },

      {
        name: '音楽心理学',
        genres: [
          {
            sign: 'M0.15',
            name: '音楽心理学・音楽と感情・音楽療法',
          },
        ],
      },
    ],
  },

  {
    name: '統計科学、情報科学関連の本棚',
    categories: [
      {
        name: '情報科学',
        genres: [
          {
            sign: '007',
            name: '情報学・情報科学',
          },
          {
            sign: '007.1',
            name: '情報理論・人工知能・AI',
          },
          {
            sign: '007.3',
            name: '情報と社会・情報政策・情報セキュリティ',
          },
          {
            sign: '007.6',
            name: 'データ処理・情報処理・プログラミング・情報リテラシー',
          },
        ],
      },

      {
        name: '数理統計・統計学',
        genres: [
          {
            sign: '417',
            name: '近代統計学・確率・回帰分析・データ解析',
          },
        ],
      },
    ],
  },

  {
    name: 'コミュニケーション関連の本棚',
    categories: [
      {
        name: '社会学',
        genres: [
          {
            sign: '361.45',
            name: 'コミュニケーション・コミュニケーション理論',
          },
        ],
      },

      {
        name: '言語学',
        genres: [
          {
            sign: '801',
            name: '社会言語学・音声・発音・翻訳・通訳・会話・非言語コミュニケーション',
          },
          {
            sign: '817',
            name: '日本語会話',
          },
          {
            sign: '830',
            name: '英語学・英語学習・英語教育・通訳',
          },
          {
            sign: '837',
            name: '英会話',
          },
        ],
      },
    ],
  },

  {
    name: 'アメリカ文化関連の本棚',
    categories: [
      {
        name: '歴史',
        genres: [
          {
            sign: '250',
            name: '北アメリカの歴史',
          },
          {
            sign: '253',
            name: 'アメリカ合衆国の歴史',
          },
        ],
      },

      {
        name: '地理',
        genres: [
          {
            sign: '295',
            name: '北アメリカの地理',
          },
        ],
      },

      {
        name: '社会学',
        genres: [
          {
            sign: '302.5',
            name: '北アメリカの政治・経済・社会文化事情',
          },
          {
            sign: '312.53',
            name: 'アメリカ合衆国の政治',
          },
        ],
      },

      {
        name: 'アメリカの風俗習慣、民俗学、民族学',
        genres: [
          {
            sign: '380～389',
            name: '※風俗・民俗関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: 'アメリカの芸術、美術、メディア',
        genres: [
          {
            sign: '700～759',
            name: '※芸術、工芸関連図書の中にあり（OPAC検索推奨）',
          },
          {
            sign: '770～779',
            name: '※演劇、映画、アニメ関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: '文学',
        genres: [
          {
            sign: 'A930～A939',
            name: 'アメリカ文学',
          },
        ],
      },
    ],
  },

  {
    name: '多文化共生・比較文化関連の本棚',
    categories: [
      {
        name: '社会学',
        genres: [
          {
            sign: '334',
            name: '人口・移民・難民・移民政策・多文化共生',
          },
          {
            sign: '361.45',
            name: 'コミュニケーション・異文化コミュニケーション',
          },
          {
            sign: '370～379',
            name: '※学校教育、教育現場の異文化・多文化関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: '言語学',
        genres: [
          {
            sign: '800～899',
            name: '※言語教育、言語文化等関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },
    ],
  },

  {
    name: 'ジェンダー・マイノリティ関連の本棚',
    categories: [
      {
        name: '社会学',
        genres: [
          {
            sign: '316.1',
            name: '基本的人権・自由と平等',
          },
          {
            sign: '316.8',
            name: '民族・人種問題・人種差別・民族運動',
          },
          {
            sign: '320',
            name: '法律・法学・裁判例',
          },
          {
            sign: '334',
            name: '人口・移民・難民・移民政策・多文化共生',
          },
          {
            sign: '367',
            name: '家族・ジェンダー・婚姻・女性論・女性史・男性論・性問題・セクシャルマイノリティ',
          },
        ],
      },
    ],
  },

  {
    name: '音楽、アート、メディア関連の本棚',
    categories: [
      {
        name: '音楽、楽譜',
        genres: [
          {
            sign: 'M0.0～M5.9',
            name: '音楽関連図書',
          },
          {
            sign: 'M0.0～M0.9',
            name: '音楽学・音楽心理・音楽療法・音楽評論・音楽著作権',
          },
          {
            sign: 'M0.4',
            name: '音楽談義・音楽批評',
          },
          {
            sign: 'M0.67',
            name: '音楽著作権',
          },
          {
            sign: 'M0.9',
            name: '映画音楽・アニメ音楽',
          },
          {
            sign: 'M1.0～M1.9',
            name: '楽典・和声法・作曲法・演奏法・鑑賞法',
          },
          {
            sign: 'M2.0～M2.9',
            name: '音楽史・各国の音楽・作曲家研究・演奏家研究・伝記',
          },
          {
            sign: 'M3.0～M3.9',
            name: '声楽・歌唱法・宗教音楽・賛美歌・歌劇・バレエ・民謡',
          },
          {
            sign: 'M4.0～M4.9',
            name: '器楽・楽器・室内楽・管弦楽・吹奏楽・ロック・ジャズ・ポップ',
          },
          {
            sign: 'M4.57',
            name: 'コンピュータミュージック',
          },
          {
            sign: 'M5.0～M5.9',
            name: '邦楽・雅楽・能楽・狂言・民謡・現代邦楽',
          },
          {
            sign: 'M6.0～M9.9',
            name: '楽譜',
          },
          {
            sign: 'M6.0～M6.9',
            name: '声楽曲・宗教音楽・ミュージカル・唱歌・民謡・流行歌',
          },
          {
            sign: 'M7.0～M7.9',
            name: '器楽曲・管弦楽曲・ピアノ曲・吹奏楽曲・軽音楽曲',
          },
          {
            sign: 'M8.0～M8.9',
            name: '作品集・個人全集・ミニチュアスコア',
          },
          {
            sign: 'M9.0～M9.9',
            name: '邦楽曲',
          },
        ],
      },

      {
        name: '芸術、美術、大衆文化',
        genres: [
          {
            sign: '701',
            name: '芸術理論・美学',
          },
          {
            sign: '702',
            name: '芸術史・美術史',
          },
          {
            sign: '710～719',
            name: '彫刻',
          },
          {
            sign: '720～729',
            name: '絵画',
          },
          {
            sign: '721',
            name: '日本絵画・絵巻・浮世絵・草紙',
          },
          {
            sign: '723',
            name: '西洋絵画',
          },
          {
            sign: '726',
            name: 'マンガ・絵本・挿絵',
          },
          {
            sign: '750～759',
            name: '工芸・陶磁器・ガラス工芸・木工・宝石・色彩・インテリア',
          },
          {
            sign: '770～779',
            name: '演劇',
          },
          {
            sign: '771',
            name: '劇場・演出・俳優・演技・舞台衣装',
          },
          {
            sign: '773',
            name: '能楽・狂言',
          },
          {
            sign: '774',
            name: '歌舞伎',
          },
          {
            sign: '775',
            name: '各種演劇・宝塚歌劇・ミュージカル・新劇',
          },
          {
            sign: '778',
            name: '映画・アニメ・テレビドラマ・特撮',
          },
        ],
      },

      {
        name: 'マスメディア、ジャーナリズム',
        genres: [
          {
            sign: '070',
            name: 'ジャーナリズム・報道・新聞学',
          },
          {
            sign: '361.4',
            name: '社会心理学・マスコミ・マスメディア',
          },
          {
            sign: '699',
            name: '放送事業・テレビ・ラジオ・視聴率・放送番組',
          },
        ],
      },
    ],
  },

  {
    name: '宗教、キリスト教関連の本棚',
    categories: [
      {
        name: '宗教',
        genres: [
          {
            sign: '160～169',
            name: '宗教学・比較宗教・イスラム教・新興宗教',
          },
          {
            sign: '170～179',
            name: '神道・神道史・神社・祭祀',
          },
          {
            sign: '180～189',
            name: '仏教・仏教史・寺院・法話・説教',
          },
          {
            sign: '190～199',
            name: 'キリスト教・キリスト教神学・教義',
          },
          {
            sign: '192',
            name: 'キリスト教史・迫害史・イエス伝',
          },
          {
            sign: '193',
            name: '聖書・旧約・新約・福音書',
          },
          {
            sign: '195',
            name: '教会・修道院・司教・司祭・神父・牧師',
          },
          {
            sign: '197',
            name: '布教・伝道',
          },
          {
            sign: '199',
            name: 'ユダヤ教',
          },
        ],
      },

      {
        name: '世界、各国の歴史・政治とキリスト教',
        genres: [
          {
            sign: '200～279',
            name: '※各国の歴史関連図書の中にあり（OPAC検索推奨）',
          },
          {
            sign: '310～319',
            name: '※各国の政治関連図書の中にあり（OPAC検索推奨）',
          },
          {
            sign: '316',
            name: '※国家と宗教関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: 'キリスト教美術、図像、宗教芸術、宗教画',
        genres: [
          {
            sign: '700～759',
            name: '※芸術、工芸関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: 'キリスト教と文学',
        genres: [
          {
            sign: '900～999',
            name: '※文学関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },

      {
        name: 'キリスト教と音楽',
        genres: [
          {
            sign: 'M3.37',
            name: '讃美歌・聖歌',
          },
        ],
      },
    ],
  },
]
