import type { Shelves } from '@/types'

export const browseInternational: Shelves = [
  {
    name: 'アメリカ・ラテンアメリカ関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.5 ',
            name: '北アメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.55',
            name: 'ラテンアメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.6',
            name: '南アメリカの政治・経済・社会文化事情',
          },
        ],
      },
      {
        name: '哲学・思想',
        genres: [
          {
            sign: '130',
            name: '西洋哲学・西洋思想',
          },
        ],
      },
      {
        name: '歴史',
        genres: [
          {
            sign: '250',
            name: '北アメリカの歴史',
          },
          {
            sign: '253',
            name: 'アメリカ合衆国の歴史',
          },
          {
            sign: '256',
            name: 'メキシコの歴史',
          },
          {
            sign: '260',
            name: '南アメリカの歴史',
          },
          {
            sign: '262',
            name: 'ブラジルの歴史',
          },
          {
            sign: '265',
            name: 'アルゼンチンの歴史',
          },
          {
            sign: '268',
            name: 'ペルーの歴史',
          },
        ],
      },
      {
        name: '地理',
        genres: [
          {
            sign: '295',
            name: '北アメリカの地理',
          },
          {
            sign: '296',
            name: '南アメリカの地理',
          },
        ],
      },
      {
        name: '政治',
        genres: [
          {
            sign: '312.53',
            name: 'アメリカ合衆国の政治',
          },
          {
            sign: '312.5～312.8',
            name: 'ラテンアメリカの政治',
          },
        ],
      },
      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.53',
            name: 'アメリカ合衆国の外交',
          },
        ],
      },
      {
        name: '文学',
        genres: [
          {
            sign: '930',
            name: '英米文学',
          },
          {
            sign: 'A930～A939',
            name: 'アメリカ文学',
          },
          {
            sign: '968',
            name: 'ラテンアメリカ文学',
          },
        ],
      },
    ],
  },
  {
    name: 'イギリス・フランス・ドイツ・ヨーロッパ関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.33',
            name: 'イギリスの政治・経済・社会文化事情',
          },
          {
            sign: '302.34',
            name: 'ドイツの政治・経済・社会文化事情',
          },
          {
            sign: '302.35',
            name: 'フランスの政治・経済・社会文化事情',
          },
          {
            sign: '302.38',
            name: 'ロシア・ベラルーシ・ウクライナの政治・経済・社会文化事情',
          },
        ],
      },
      {
        name: '哲学・思想',
        genres: [
          {
            sign: '130',
            name: '西洋哲学・西洋思想',
          },
        ],
      },
      {
        name: '歴史',
        genres: [
          {
            sign: '230',
            name: 'ヨーロッパの歴史',
          },
          {
            sign: '233',
            name: 'イギリスの歴史',
          },
          {
            sign: '234',
            name: 'ドイツの歴史',
          },
          {
            sign: '235',
            name: 'フランスの歴史',
          },
          {
            sign: '236',
            name: 'スペイン・ポルトガルの歴史',
          },
          {
            sign: '237',
            name: 'イタリアの歴史',
          },
          {
            sign: '238',
            name: 'ロシア・北ヨーロッパの歴史',
          },
        ],
      },
      {
        name: '地理',
        genres: [
          {
            sign: '293',
            name: 'ヨーロッパの地理',
          },
        ],
      },
      {
        name: '政治',
        genres: [
          {
            sign: '312.3',
            name: 'ヨーロッパの政治',
          },
        ],
      },
      {
        name: '民族・人種問題',
        genres: [
          {
            sign: '316.88',
            name: 'ユダヤ人問題',
          },
        ],
      },
      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.3',
            name: '欧州統合・ヨーロッパの外交',
          },
        ],
      },
      {
        name: '文学',
        genres: [
          {
            sign: '930',
            name: '英米文学',
          },
          {
            sign: '930～939',
            name: 'イギリス文学',
          },
          {
            sign: '940～949',
            name: 'ドイツ文学',
          },
          {
            sign: '950～959',
            name: 'フランス文学',
          },
          {
            sign: '960～969',
            name: 'スペイン・ポルトガル文学',
          },
          {
            sign: '970～979',
            name: 'イタリア文学',
          },
          {
            sign: '980～989',
            name: 'ロシア・ソヴィエト・スラブ文学',
          },
          {
            sign: '991～993',
            name: 'ギリシア・ラテン・その他のヨーロッパ文学',
          },
        ],
      },
    ],
  },
  {
    name: '中国・アジア関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.2',
            name: 'アジアの政治・経済・社会文化事情',
          },
          {
            sign: '302.21',
            name: '韓国・朝鮮の政治・経済・社会文化事情',
          },
          {
            sign: '302.22',
            name: '中国の政治・経済・社会文化事情',
          },
          {
            sign: '302.23',
            name: '東南アジアの政治・経済・社会文化事情',
          },
          {
            sign: '302.23',
            name: 'インドネシアの政治・経済・社会文化事情',
          },
          {
            sign: '302.25',
            name: 'インドの政治・経済・社会文化事情',
          },
          {
            sign: '302.27',
            name: '中東の政治・経済・社会文化事情',
          },
        ],
      },
      {
        name: '哲学・思想',
        genres: [
          {
            sign: '120',
            name: '東洋思想・中国哲学・アジア哲学',
          },
        ],
      },
      {
        name: '歴史',
        genres: [
          {
            sign: '221',
            name: '韓国・朝鮮の歴史',
          },
          {
            sign: '222',
            name: '中国の歴史',
          },
          {
            sign: '223',
            name: '東南アジアの歴史',
          },
          {
            sign: '225',
            name: 'インドの歴史',
          },
          {
            sign: '226～228',
            name: '中東・アラブ諸国の歴史',
          },
        ],
      },
      {
        name: '地理',
        genres: [
          {
            sign: '292',
            name: 'アジアの地理',
          },
        ],
      },
      {
        name: '政治',
        genres: [
          {
            sign: '312.2',
            name: 'アジアの政治',
          },
        ],
      },
      {
        name: '民族・人種問題',
        genres: [
          {
            sign: '316.81～316.82',
            name: '在日朝鮮人・アイヌ問題',
          },
        ],
      },
      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.2',
            name: 'アジアの外交',
          },
        ],
      },
      {
        name: '文学',
        genres: [
          {
            sign: '920～928',
            name: '中国文学',
          },
          {
            sign: '929.1',
            name: '韓国・朝鮮文学',
          },
          {
            sign: '929.2～929.9',
            name: 'その他の東洋文学',
          },
        ],
      },
    ],
  },
  {
    name: '国際関係、国際政治経済関連の本棚',
    categories: [
      {
        name: '各国の情勢、情報',
        genres: [
          {
            sign: '302.1',
            name: '日本の政治・経済・社会文化事情',
          },
          {
            sign: '302.2',
            name: 'アジアの政治・経済・社会文化事情',
          },
          {
            sign: '302.3',
            name: 'ヨーロッパの政治・経済・社会文化事情',
          },
          {
            sign: '302.4',
            name: 'アフリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.5',
            name: '北アメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.6',
            name: '南アメリカの政治・経済・社会文化事情',
          },
          {
            sign: '302.7',
            name: 'オセアニアの政治・経済・社会文化事情',
          },
        ],
      },
      {
        name: '政治',
        genres: [
          {
            sign: '311',
            name: '政治学・政治哲学・政治思想',
          },
          {
            sign: '311.3',
            name: 'ナショナリズム・民族主義',
          },
          {
            sign: '311.7',
            name: '民主主義',
          },
          {
            sign: '311.9',
            name: '社会主義・共産主義',
          },
        ],
      },
      {
        name: '国際関係',
        genres: [
          {
            sign: '319',
            name: '国際問題・国際関係',
          },
          {
            sign: '319.1',
            name: '日本の外交',
          },
          {
            sign: '319.2',
            name: 'アジアの外交',
          },
          {
            sign: '319.3',
            name: '欧州統合・ヨーロッパの外交',
          },
          {
            sign: '319.4',
            name: 'アフリカの外交',
          },
          {
            sign: '319.5',
            name: 'アメリカの外交',
          },
          {
            sign: '319.8',
            name: '戦争と平和',
          },
          {
            sign: '319.9',
            name: '国際連合・国際会議',
          },
        ],
      },
      {
        name: '経済',
        genres: [
          {
            sign: '332',
            name: '経済事情・経済体制',
          },
          {
            sign: '332.1',
            name: '日本の経済事情・経済体制',
          },
          {
            sign: '332.2',
            name: 'アジアの経済事情・経済体制',
          },
          {
            sign: '332.3',
            name: 'ヨーロッパの経済事情・経済体制',
          },
          {
            sign: '332.4',
            name: 'アフリカの経済事情・経済体制',
          },
          {
            sign: '332.5',
            name: '北アメリカの経済事情・経済体制',
          },
          {
            sign: '332.6',
            name: '南アメリカの経済事情・経済体制',
          },
          {
            sign: '333.6',
            name: '世界経済・国際経済',
          },
          {
            sign: '333.7',
            name: '経済統合（EU・APEC等）',
          },
          {
            sign: '333.8',
            name: '経済協力・経済援助',
          },
          {
            sign: '678',
            name: '貿易',
          },
          {
            sign: '678.3',
            name: '通商条約・協定・関税',
          },
        ],
      },
      {
        name: '人口移動・移民',
        genres: [
          {
            sign: '334.3',
            name: '人口問題・人口政策',
          },
          {
            sign: '334.4～334.5',
            name: '移民・難民問題',
          },
        ],
      },
    ],
  },
  {
    name: '地球環境問題関連の本棚',
    categories: [
      {
        name: '環境問題',
        genres: [
          {
            sign: '519',
            name: '環境工学・公害問題',
          },
          {
            sign: '519.1',
            name: '環境政策・リサイクル・脱炭素',
          },
          {
            sign: '519.2',
            name: '環境史・公害の歴史',
          },
          {
            sign: '519.3',
            name: '大気汚染・PM2.5問題・オゾン層破壊',
          },
          {
            sign: '519.4',
            name: '海洋汚染・水質汚濁',
          },
          {
            sign: '519.8',
            name: '環境保全・自然保護',
          },
        ],
      },
      {
        name: '異常気象・温暖化',
        genres: [
          {
            sign: '450',
            name: '地球科学・地学',
          },
          {
            sign: '451',
            name: '気象学・気候・温暖化問題',
          },
        ],
      },
      {
        name: '自然保護',
        genres: [
          {
            sign: '460',
            name: '生物学・生物多様性',
          },
          {
            sign: '519.8',
            name: '環境保全・自然保護',
          },
        ],
      },
      {
        name: 'エネルギー',
        genres: [
          {
            sign: '501.6',
            name: 'エネルギー',
          },
          {
            sign: '543',
            name: '発電（水力・火力・原子力・風力・太陽光等）',
          },
        ],
      },
    ],
  },
  {
    name: '法学・法律関連の本棚',
    categories: [
      {
        name: '法律',
        genres: [
          {
            sign: '321',
            name: '法学',
          },
          {
            sign: '323',
            name: '憲法',
          },
          {
            sign: '324',
            name: '民法',
          },
          {
            sign: '326',
            name: '刑法',
          },
          {
            sign: '329',
            name: '国際法・条約',
          },
        ],
      },
    ],
  },
  {
    name: '経済学・経営学・ビジネス関連の本棚',
    categories: [
      {
        name: '経済学',
        genres: [
          {
            sign: '331',
            name: '経済学・経済思想',
          },
          {
            sign: '331.6',
            name: 'マルクス経済学',
          },
          {
            sign: '331.7',
            name: '近代経済学',
          },
          {
            sign: '332.1',
            name: '日本経済史・経済事情',
          },
          {
            sign: '332.2～332.7',
            name: '外国経済史・経済事情',
          },
          {
            sign: '333',
            name: '経済政策・国際経済',
          },
        ],
      },
      {
        name: '経営学',
        genres: [
          {
            sign: '335',
            name: '経営学・企業理論',
          },
          {
            sign: '336',
            name: '経営管理',
          },
          {
            sign: '336.1',
            name: '経営計画・経営戦略',
          },
          {
            sign: '336.3',
            name: '経営組織・リーダーシップ',
          },
          {
            sign: '336.4',
            name: '人事管理・労務管理・ビジネスマナー',
          },
          {
            sign: '336.9',
            name: '企業会計・財務諸表・簿記',
          },
          {
            sign: '365',
            name: '生活・消費者問題',
          },
          {
            sign: '673',
            name: '商業経営',
          },
          {
            sign: '673.7',
            name: '小売業・専門店の経営',
          },
          {
            sign: '673.8',
            name: '百貨店・チェーンストア・コンビニの経営',
          },
          {
            sign: '673.9',
            name: 'サービス業の経営',
          },
          {
            sign: '689',
            name: '観光事業',
          },
          {
            sign: '689',
            name: '観光事業経営・テーマパーク',
          },
        ],
      },
      {
        name: '金融・通貨',
        genres: [
          {
            sign: '337',
            name: '貨幣・通貨',
          },
          {
            sign: '337.8',
            name: '物価',
          },
          {
            sign: '338',
            name: '金融・銀行',
          },
          {
            sign: '338.9',
            name: '国際金融・海外投資・世界銀行・外国為替',
          },
        ],
      },
      {
        name: '就職・労働',
        genres: [
          {
            sign: '366',
            name: '労働経済・労働問題',
          },
          {
            sign: '366.2',
            name: '労働市場・雇用・キャリアデザイン',
          },
          {
            sign: '366.3',
            name: '労働条件・労働者保護',
          },
          {
            sign: '366.9',
            name: '労働科学・産業心理学',
          },
        ],
      },
      {
        name: '広告・宣伝',
        genres: [
          {
            sign: '674',
            name: '広告宣伝・商業デザイン',
          },
        ],
      },
    ],
  },
  {
    name: '観光・運輸関連の本棚',
    categories: [
      {
        name: '地誌・紀行',
        genres: [
          {
            sign: '290',
            name: '各国の地理・地誌・景観・史跡・紀行・旅行ガイド',
          },
        ],
      },
      {
        name: '余暇・レジャー',
        genres: [
          {
            sign: '365.7',
            name: '余暇・レジャー',
          },
        ],
      },
      {
        name: '交通・観光',
        genres: [
          {
            sign: '680',
            name: '運輸・交通',
          },
          {
            sign: '685',
            name: '陸運・道路・自動車・バス・駐車場',
          },
          {
            sign: '686',
            name: '鉄道・路面電車・ケーブルカー',
          },
          {
            sign: '687',
            name: '航空・空港',
          },
          {
            sign: '689',
            name: '観光政策・観光事業・観光地・観光施設',
          },
        ],
      },
    ],
  },
  {
    name: '統計科学、情報科学関連の本棚',
    categories: [
      {
        name: '情報科学',
        genres: [
          {
            sign: '007',
            name: '情報学・情報科学',
          },
          {
            sign: '007.1',
            name: '情報理論・人工知能・AI',
          },
          {
            sign: '007.3',
            name: '情報と社会・情報政策・情報セキュリティ',
          },
          {
            sign: '007.6',
            name: 'データ処理・情報処理・プログラミング・情報リテラシー',
          },
        ],
      },
      {
        name: '数理統計・統計学',
        genres: [
          {
            sign: '417',
            name: '近代統計学・確率・回帰分析・データ解析',
          },
        ],
      },
    ],
  },
  {
    name: '音楽、アート、メディア関連の本棚',
    categories: [
      {
        name: '音楽、楽譜',
        genres: [
          {
            sign: 'M0.0～M5.9',
            name: '音楽関連図書',
          },
          {
            sign: 'M0.0～M0.9',
            name: '音楽学・音楽心理・音楽療法・音楽評論・音楽著作権',
          },
          {
            sign: 'M0.4',
            name: '音楽談義・音楽批評',
          },
          {
            sign: 'M0.67',
            name: '音楽著作権',
          },
          {
            sign: 'M0.9',
            name: '映画音楽・アニメ音楽',
          },
          {
            sign: 'M1.0～M1.9',
            name: '楽典・和声法・作曲法・演奏法・鑑賞法',
          },
          {
            sign: 'M2.0～M2.9',
            name: '音楽史・各国の音楽・作曲家研究・演奏家研究・伝記',
          },
          {
            sign: 'M3.0～M3.9',
            name: '声楽・歌唱法・宗教音楽・賛美歌・歌劇・バレエ・民謡',
          },
          {
            sign: 'M4.0～M4.9',
            name: '器楽・楽器・室内楽・管弦楽・吹奏楽・ロック・ジャズ・ポップ',
          },
          {
            sign: 'M4.57',
            name: 'コンピュータミュージック',
          },
          {
            sign: 'M5.0～M5.9',
            name: '邦楽・雅楽・能楽・狂言・民謡・現代邦楽',
          },
          {
            sign: 'M6.0～M9.9',
            name: '楽譜',
          },
          {
            sign: 'M6.0～M6.9',
            name: '声楽曲・宗教音楽・ミュージカル・唱歌・民謡・流行歌',
          },
          {
            sign: 'M7.0～M7.9',
            name: '器楽曲・管弦楽曲・ピアノ曲・吹奏楽曲・軽音楽曲',
          },
          {
            sign: 'M8.0～M8.9',
            name: '作品集・個人全集・ミニチュアスコア',
          },
          {
            sign: 'M9.0～M9.9',
            name: '邦楽曲',
          },
        ],
      },
      {
        name: '芸術、美術、大衆文化',
        genres: [
          {
            sign: '701',
            name: '芸術理論・美学',
          },
          {
            sign: '702',
            name: '芸術史・美術史',
          },
          {
            sign: '710～719',
            name: '彫刻',
          },
          {
            sign: '720～729',
            name: '絵画',
          },
          {
            sign: '721',
            name: '日本絵画・絵巻・浮世絵・草紙',
          },
          {
            sign: '723',
            name: '西洋絵画',
          },
          {
            sign: '726',
            name: 'マンガ・絵本・挿絵',
          },
          {
            sign: '750～759',
            name: '工芸・陶磁器・ガラス工芸・木工・宝石・色彩・インテリア',
          },
          {
            sign: '770～779',
            name: '演劇',
          },
          {
            sign: '771',
            name: '劇場・演出・俳優・演技・舞台衣装',
          },
          {
            sign: '773',
            name: '能楽・狂言',
          },
          {
            sign: '774',
            name: '歌舞伎',
          },
          {
            sign: '775',
            name: '各種演劇・宝塚歌劇・ミュージカル・新劇',
          },
          {
            sign: '778',
            name: '映画・アニメ・テレビドラマ・特撮',
          },
        ],
      },
      {
        name: 'マスメディア、ジャーナリズム',
        genres: [
          {
            sign: '070',
            name: 'ジャーナリズム・報道・新聞学',
          },
          {
            sign: '361.4',
            name: '社会心理学・マスコミ・マスメディア',
          },
          {
            sign: '699',
            name: '放送事業・テレビ・ラジオ・視聴率・放送番組',
          },
        ],
      },
    ],
  },
  {
    name: '宗教、キリスト教関連の本棚',
    categories: [
      {
        name: '宗教',
        genres: [
          {
            sign: '160～169',
            name: '宗教学・比較宗教・イスラム教・新興宗教',
          },
          {
            sign: '170～179',
            name: '神道・神道史・神社・祭祀',
          },
          {
            sign: '180～189',
            name: '仏教・仏教史・寺院・法話・説教',
          },
          {
            sign: '190～199',
            name: 'キリスト教・キリスト教神学・教義',
          },
          {
            sign: '192',
            name: 'キリスト教史・迫害史・イエス伝',
          },
          {
            sign: '193',
            name: '聖書・旧約・新約・福音書',
          },
          {
            sign: '195',
            name: '教会・修道院・司教・司祭・神父・牧師',
          },
          {
            sign: '197',
            name: '布教・伝道',
          },
          {
            sign: '199',
            name: 'ユダヤ教',
          },
        ],
      },
      {
        name: '世界、各国の歴史・政治とキリスト教',
        genres: [
          {
            sign: '200～279',
            name: '※各国の歴史関連図書の中にあり（OPAC検索推奨）',
          },
          {
            sign: '310～319',
            name: '※各国の政治関連図書の中にあり（OPAC検索推奨）',
          },
          {
            sign: '316',
            name: '※国家と宗教関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },
      {
        name: 'キリスト教美術、図像、宗教芸術、宗教画',
        genres: [
          {
            sign: '700～759',
            name: '※芸術、工芸関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },
      {
        name: 'キリスト教と文学',
        genres: [
          {
            sign: '900～999',
            name: '※文学関連図書の中にあり（OPAC検索推奨）',
          },
        ],
      },
      {
        name: 'キリスト教と音楽',
        genres: [
          {
            sign: 'M3.37',
            name: '讃美歌・聖歌',
          },
        ],
      },
    ],
  },
]
